Конфигурация/Documents/ПриходПроцентовПоКредитномуИнструменту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПриходПроцентовПоКредитномуИнструменту</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ПроцентыПоКредитнымИнструментам</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКредитныхИнструментах</xr:Item>
				<xr:Item>InformationRegister.НоминалыКредитныхИнструментов</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложеннаяОплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Comment>Дата начала интервала, за который начисляются проценты</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Comment>Дата окончания интервала, за который начисляются проценты</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реинвестирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастичныйПриходПроцентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ВидыКредитныхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКредитныхИнструментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выданный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полученный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПриходПроцентовПоКредитномуИнструменту/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Данные.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		Если Данные.Реинвестирование Тогда
			Представление = "Реинвестирование процентов по депозитному вкладу ";
		Иначе
			Представление = "Приход процентов по депозитному вкладу ";
		КонецЕсли; 
	ИначеЕсли ТипЗнч(Данные.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
		Если  Данные.КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный Тогда
			Представление = "Проценты по займу выданному ";
		Иначе
			Представление = "Проценты по займу полученному ";
		КонецЕсли;
	КонецЕсли;

	Представление = Представление + Данные.Номер + " от "+ Данные.Дата;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("Реинвестирование");
	Поля.Добавить("КредитныйИнструмент");
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОтразитьНачислениеПроцентовПоРегиструБухгалтерии(ДокументСсылка, Движения, УчетныйРегистр, ПараметрыУчетаАктива, Сумма, Отказ) Экспорт

	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Дата, Организация, СчетДоверительногоУправления, РасчетныйСчет");
	
	Дата = ДанныеДокумента.Дата;
	Организация = ДанныеДокумента.Организация;
	СчетДоверительногоУправления = ДанныеДокумента.СчетДоверительногоУправления;
	РасчетныйСчет = ДанныеДокумента.РасчетныйСчет;
	
	СчетДоходов = ПланыСчетов.Основной.ПрочиеДоходы;	
	СчетРасходов = ПланыСчетов.Основной.ПрочиеРасходы;
		
	СчетУчетаДС = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		РасчетныйСчет.Валюта,
		Справочники.БрокерскиеКомпании.ПустаяСсылка());	
		
	ЭтоПИФ = СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда;
	
	ЭтоПлановаяОперация = Не ЭтоПИФ;//только для ПИФ сторнируем аналитику переоценки
	
	Если ПараметрыУчетаАктива.УчетныйАктив = Справочники.УчетныеАктивы.ЗаймыВыданные
		Или ПараметрыУчетаАктива.УчетныйАктив = Справочники.УчетныеАктивы.ЗаймыПолученныеДолгосрочные
		Или ПараметрыУчетаАктива.УчетныйАктив = Справочники.УчетныеАктивы.ЗаймыПолученныеКраткосрочные Тогда
		
		ЭтоПлановаяОперация = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(БухгалтерскийУчетРасчеты.СуммаОстаток, 0) КАК СуммаОстатокРасчеты,
			|	ЕСТЬNULL(БухгалтерскийУчетПроценты.СуммаОстаток, 0) КАК СуммаОстатокПроценты,
			|	ЕСТЬNULL(БухгалтерскийУчетПроценты.Счет, НЕОПРЕДЕЛЕНО) КАК СчетПроцентов,
			|	БухгалтерскийУчетРасчеты.Счет КАК СчетЗайма
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&Период,
			|			Счет В (&СчетаЗайма),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Займы),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И Субконто1 = &Займ) КАК БухгалтерскийУчетРасчеты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|				&Период,
			|				Счет В (&СчетаПроцентов),
			|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Займы),
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|					И Субконто1 = &Займ) КАК БухгалтерскийУчетПроценты
			|		ПО БухгалтерскийУчетРасчеты.Субконто1 = БухгалтерскийУчетПроценты.Субконто1";

		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления));
		Запрос.УстановитьПараметр("Период", Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Займ", ПараметрыУчетаАктива.Актив);
		
		СчетаЗайма = Новый Массив;
		СчетаПроцентов = Новый Массив;
		
		СчетаЗайма.Добавить(ПараметрыУчетаАктива.СчетУчетаАктива);
		СчетаПроцентов.Добавить(ПараметрыУчетаАктива.СчетПереоценкиРасчетов);
		
		Если ПараметрыУчетаАктива.УчетныйАктив = Справочники.УчетныеАктивы.ЗаймыПолученныеДолгосрочные
			ИЛИ ПараметрыУчетаАктива.УчетныйАктив = Справочники.УчетныеАктивы.ЗаймыПолученныеКраткосрочные Тогда
			
			СчетаЗайма.Добавить(БухгалтерскийУчет.ОпределитьСчетУчетаАктивов(
			Дата, 
			Организация, 
			СчетДоверительногоУправления,
			?(ПараметрыУчетаАктива.УчетныйАктив = Справочники.УчетныеАктивы.ЗаймыПолученныеДолгосрочные,Справочники.УчетныеАктивы.ЗаймыПолученныеКраткосрочные,Справочники.УчетныеАктивы.ЗаймыПолученныеДолгосрочные),
			УчетныйРегистр));
			
			СчетаПроцентов.Добавить(БухгалтерскийУчет.ОпределитьСчетУчетаПереоценкиАктивов(
			Дата, 
			Организация, 
			СчетДоверительногоУправления,
			?(ПараметрыУчетаАктива.УчетныйАктив = Справочники.УчетныеАктивы.ЗаймыПолученныеДолгосрочные,Справочники.УчетныеАктивы.ЗаймыПолученныеКраткосрочные,Справочники.УчетныеАктивы.ЗаймыПолученныеДолгосрочные),
			УчетныйРегистр));
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("СчетаЗайма", СчетаЗайма);
		Запрос.УстановитьПараметр("СчетаПроцентов", СчетаПроцентов);

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Количество()>1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На счетах учета по займу " + ПараметрыУчетаАктива.Актив + " задвоены остатки", ДокументСсылка,,, Отказ);
			Возврат;
		ИначеЕсли Выборка.Количество()=0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На счетах учета по займу " + ПараметрыУчетаАктива.Актив + " не найден остаток", ДокументСсылка,,, Отказ);
			Возврат;
		КонецЕсли;
		
		ОсновнойАктивЯвляетсяДебиторкой = ПараметрыУчетаАктива.УчетныйАктив = Справочники.УчетныеАктивы.ЗаймыВыданные;
		
		
	ИначеЕсли ПараметрыУчетаАктива.УчетныйАктив = Справочники.УчетныеАктивы.Инвестконтракты Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(БухгалтерскийУчетПроценты.СуммаОстаток, 0) КАК СуммаОстатокПроценты,
			|	ЕСТЬNULL(БухгалтерскийУчетПроценты.Счет, НЕОПРЕДЕЛЕНО) КАК СчетПроцентов
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
			|			&Период,
			|			Счет  = &СчетПроцентов,
			|			&ВидыСубконто,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И Субконто1 = &Контрагент
			|				И Субконто2 = &Основание) КАК БухгалтерскийУчетПроценты";

		МассивСубконто = новый Массив;
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов);
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(СчетДоверительногоУправления));
		Запрос.УстановитьПараметр("Период", Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("ВидыСубконто", МассивСубконто);
		Запрос.УстановитьПараметр("Контрагент", ПараметрыУчетаАктива.Контрагент);
		Запрос.УстановитьПараметр("Основание", ПараметрыУчетаАктива.Актив);
		Запрос.УстановитьПараметр("СчетПроцентов", ПараметрыУчетаАктива.СчетПереоценкиРасчетов);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		//для инвестконтракта только дебиторка
		ОсновнойАктивЯвляетсяДебиторкой = Истина;
		
		НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(Дата, Организация, СчетДоверительногоУправления);
		ПараметрыУчетаАктива.АналитикаПереоценки = НастройкиУчета.АналитикаПереоценкиДебиторскойЗадолженности;		

	КонецЕсли;
	
	СторонаАктива = ?(ОсновнойАктивЯвляетсяДебиторкой, "Кт", "Дт");
	
	ЕстьСубконтоОснованиеРасчетов	= (ПараметрыУчетаАктива.СчетПереоценкиРасчетов.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов) <> Неопределено);
	
	Пока Выборка.Следующий() Цикл
		
		СторонаДС = ?(СторонаАктива = "Дт", "Кт", "Дт");
		
		Если ЭтоПИФ И ПараметрыУчетаАктива.АналитикаПереоценки <> ПараметрыУчетаАктива.АналитикаДоходов Тогда
			
			Если ЭтоПлановаяОперация Тогда
				Если Выборка.СуммаОстатокПроценты * Сумма < 0 Тогда
					СписатьПереоценку = 0;//переоценка начислена "в другую сторону", списывать нечего
				Иначе
					СписатьПереоценку = Мин(Выборка.СуммаОстатокПроценты, Сумма);
				КонецЕсли;
			Иначе
				Если Выборка.СуммаОстатокПроценты <> 0 Тогда
					СписатьПереоценку = Сумма;
				Иначе
					СписатьПереоценку = 0;
				КонецЕсли;
			КонецЕсли;
			
			Если СписатьПереоценку > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СписатьПереоценку, "Переоценка");
			
				// дебет
				Проводка["Счет"+СторонаДС] = ?(ОсновнойАктивЯвляетсяДебиторкой, СчетРасходов, СчетДоходов);
				Проводка["Субконто"+СторонаДС].ПрочиеДоходыИРасходы = ПараметрыУчетаАктива.АналитикаПереоценки;
				Проводка["Субконто"+СторонаДС].ЦенныеБумаги = ПараметрыУчетаАктива.Актив;
				
				// кредит
				Проводка["Счет"+СторонаАктива] = ПараметрыУчетаАктива.СчетПереоценкиРасчетов;
				Проводка["Субконто"+СторонаАктива].Контрагенты = ПараметрыУчетаАктива.Контрагент;
				Если ЕстьСубконтоОснованиеРасчетов Тогда
					Проводка["Субконто"+СторонаАктива].ОснованиеРасчетов = ПараметрыУчетаАктива.Актив;
				Иначе
					Проводка["Субконто"+СторонаАктива].Займы = ПараметрыУчетаАктива.Актив;
				КонецЕсли;
				
			КонецЕсли;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, Сумма, "Проценты");
		
			// дебет
			Проводка["Счет"+СторонаДС] = ПараметрыУчетаАктива.СчетПереоценкиРасчетов;
			Проводка["Субконто"+СторонаДС].Контрагенты = ПараметрыУчетаАктива.Контрагент;
			Если ЕстьСубконтоОснованиеРасчетов Тогда
				Проводка["Субконто"+СторонаДС].ОснованиеРасчетов = ПараметрыУчетаАктива.Актив;
			Иначе
				Проводка["Субконто"+СторонаДС].Займы = ПараметрыУчетаАктива.Актив;
			КонецЕсли;
			
			// кредит
			Проводка["Счет"+СторонаАктива] = ?(ОсновнойАктивЯвляетсяДебиторкой, СчетДоходов, СчетРасходов);
			Проводка["Субконто"+СторонаАктива].ПрочиеДоходыИРасходы = ПараметрыУчетаАктива.АналитикаДоходов;
			Проводка["Субконто"+СторонаАктива].ЦенныеБумаги = ПараметрыУчетаАктива.Актив;
				
		Иначе
			ДоначислитьПроцентов = Сумма - Выборка.СуммаОстатокПроценты * ?(ОсновнойАктивЯвляетсяДебиторкой, 1, -1);
				
			Если ДоначислитьПроцентов > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ДоначислитьПроцентов, "Проценты");
			
				// дебет
				Проводка["Счет"+СторонаДС] = ПараметрыУчетаАктива.СчетПереоценкиРасчетов;
				Проводка["Субконто"+СторонаДС].Контрагенты = ПараметрыУчетаАктива.Контрагент;
				Если ЕстьСубконтоОснованиеРасчетов Тогда
					Проводка["Субконто"+СторонаДС].ОснованиеРасчетов = ПараметрыУчетаАктива.Актив;
				Иначе
					Проводка["Субконто"+СторонаДС].Займы = ПараметрыУчетаАктива.Актив;
				КонецЕсли;
				
				// кредит
				Проводка["Счет"+СторонаАктива] = ?(ОсновнойАктивЯвляетсяДебиторкой, СчетДоходов, СчетРасходов);
				Проводка["Субконто"+СторонаАктива].ПрочиеДоходыИРасходы = ПараметрыУчетаАктива.АналитикаПереоценки;
				Проводка["Субконто"+СторонаАктива].ЦенныеБумаги = ПараметрыУчетаАктива.Актив;
				
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыУчетаАктива.ОтложеннаяОплата Тогда
			// Задолженность по процентам на дебиторку
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, Сумма, "Задолженность на сумму процентов");
		
			// дебет
			Проводка["Счет"+СторонаДС] = ПараметрыУчетаАктива.СчетУчетаРасчетовПоДоходам;
			Проводка["Субконто"+СторонаДС].Контрагенты = ПараметрыУчетаАктива.Контрагент;
			
			// кредит
			Проводка["Счет"+СторонаАктива] = ПараметрыУчетаАктива.СчетПереоценкиРасчетов;
			Проводка["Субконто"+СторонаАктива].Контрагенты = ПараметрыУчетаАктива.Контрагент;
			Если ЕстьСубконтоОснованиеРасчетов Тогда
				Проводка["Субконто"+СторонаАктива].ОснованиеРасчетов = ПараметрыУчетаАктива.Актив;
			Иначе
				Проводка["Субконто"+СторонаАктива].Займы = ПараметрыУчетаАктива.Актив;
			КонецЕсли;
		Иначе
		
			// оплата полной суммы займа
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, Сумма, "Оплата процентов");
			
			// дебет
			Проводка["Счет"+СторонаДС] = СчетУчетаДС;
			
			Проводка["Субконто"+СторонаДС].БанковскиеСчета = ПараметрыУчетаАктива.РасчетныйСчет;
			
			Если СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда 
				Проводка["Субконто"+СторонаДС].ВидДвиженияДенежныхСредств	= Справочники.ВидыДвиженияДенежныхСредств.ПогашениеЗайма;  
			КонецЕсли;
			
			// кредит
			Проводка["Счет"+СторонаАктива] = ПараметрыУчетаАктива.СчетПереоценкиРасчетов;
			Проводка["Субконто"+СторонаАктива].Контрагенты = ПараметрыУчетаАктива.Контрагент;
			Если ЕстьСубконтоОснованиеРасчетов Тогда
				Проводка["Субконто"+СторонаАктива].ОснованиеРасчетов = ПараметрыУчетаАктива.Актив;
			Иначе
				Проводка["Субконто"+СторонаАктива].Займы = ПараметрыУчетаАктива.Актив;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
